In [1]:
import pandas as pd

In [2]:
import numpy as np

In [86]:
df=pd.read_csv("data/raw/data.csv")

In [81]:
df

       Make Colour  Odometer (KM)  Doors      Price
0    Nissan  Black        10148.0    4.0  Rs1366850
1    Toyota  White        10217.0    4.0  Rs1144150
2    Toyota  White        10247.0    4.0  Rs1628300
3     Honda  White        10953.0    4.0   Rs831800
4    Nissan   Blue        10954.0    4.0  Rs1521950
..      ...    ...            ...    ...        ...
995  Toyota  White            NaN    4.0  Rs1706650
996  Toyota  White            NaN    4.0  Rs1767900
997     BMW  White            NaN    5.0  Rs1906400
998  Toyota  White            NaN    4.0        NaN
999  Toyota  White            NaN    4.0        NaN

[1000 rows x 5 columns]

In [87]:
df["Price"]=df["Price"].str[2:]

In [88]:
df

       Make Colour  Odometer (KM)  Doors    Price
0    Nissan  Black        10148.0    4.0  1366850
1    Toyota  White        10217.0    4.0  1144150
2    Toyota  White        10247.0    4.0  1628300
3     Honda  White        10953.0    4.0   831800
4    Nissan   Blue        10954.0    4.0  1521950
..      ...    ...            ...    ...      ...
995  Toyota  White            NaN    4.0  1706650
996  Toyota  White            NaN    4.0  1767900
997     BMW  White            NaN    5.0  1906400
998  Toyota  White            NaN    4.0      NaN
999  Toyota  White            NaN    4.0      NaN

[1000 rows x 5 columns]

In [89]:
df.replace({"Price":{np.nan:0}},inplace=True)

In [90]:
df

       Make Colour  Odometer (KM)  Doors    Price
0    Nissan  Black        10148.0    4.0  1366850
1    Toyota  White        10217.0    4.0  1144150
2    Toyota  White        10247.0    4.0  1628300
3     Honda  White        10953.0    4.0   831800
4    Nissan   Blue        10954.0    4.0  1521950
..      ...    ...            ...    ...      ...
995  Toyota  White            NaN    4.0  1706650
996  Toyota  White            NaN    4.0  1767900
997     BMW  White            NaN    5.0  1906400
998  Toyota  White            NaN    4.0        0
999  Toyota  White            NaN    4.0        0

[1000 rows x 5 columns]

In [91]:
df

       Make Colour  Odometer (KM)  Doors    Price
0    Nissan  Black        10148.0    4.0  1366850
1    Toyota  White        10217.0    4.0  1144150
2    Toyota  White        10247.0    4.0  1628300
3     Honda  White        10953.0    4.0   831800
4    Nissan   Blue        10954.0    4.0  1521950
..      ...    ...            ...    ...      ...
995  Toyota  White            NaN    4.0  1706650
996  Toyota  White            NaN    4.0  1767900
997     BMW  White            NaN    5.0  1906400
998  Toyota  White            NaN    4.0        0
999  Toyota  White            NaN    4.0        0

[1000 rows x 5 columns]

In [92]:
df["Price"]=df["Price"].astype(int)

In [64]:
df["Price"].dtype

dtype('int64')

In [65]:
df["Price"].isnull().sum()

np.int64(0)

In [69]:
len(df[df["Price"]==0])

50

In [75]:
df.replace({"Price":{0:df["Price"].mean()}},inplace=True)

In [76]:
len(df[df["Price"]==0])

0

In [77]:
df

       Make Colour  Odometer (KM)  Doors      Price
0    Nissan  Black        10148.0    4.0  1366850.0
1    Toyota  White        10217.0    4.0  1144150.0
2    Toyota  White        10247.0    4.0  1628300.0
3     Honda  White        10953.0    4.0   831800.0
4    Nissan   Blue        10954.0    4.0  1521950.0
..      ...    ...            ...    ...        ...
995  Toyota  White            NaN    4.0  1706650.0
996  Toyota  White            NaN    4.0  1767900.0
997     BMW  White            NaN    5.0  1906400.0
998  Toyota  White            NaN    4.0   762033.7
999  Toyota  White            NaN    4.0   762033.7

[1000 rows x 5 columns]

In [79]:
df["Make"].isnull().sum()

np.int64(49)

In [103]:
df["Make"].value_counts()

Make
Toyota    428
Honda     292
Nissan    183
BMW        97
Name: count, dtype: int64

In [95]:
df["Make"].unique()

array(['Nissan', 'Toyota', 'Honda', 'BMW', nan], dtype=object)

In [99]:
df["Make"].fillna("Toyota")

0      Nissan
1      Toyota
2      Toyota
3       Honda
4      Nissan
        ...
995    Toyota
996    Toyota
997       BMW
998    Toyota
999    Toyota
Name: Make, Length: 1000, dtype: object

In [100]:
df["Make"].unique()

array(['Nissan', 'Toyota', 'Honda', 'BMW', nan], dtype=object)

In [101]:
df.replace({"Make":{np.nan:"Toyota"}},inplace=True)

In [102]:
df["Make"].unique()

array(['Nissan', 'Toyota', 'Honda', 'BMW'], dtype=object)

In [104]:
df.isnull().sum()

Make              0
Colour           50
Odometer (KM)    50
Doors            50
Price             0
dtype: int64

In [105]:
df["Colour"]

0      Black
1      White
2      White
3      White
4       Blue
       ...
995    White
996    White
997    White
998    White
999    White
Name: Colour, Length: 1000, dtype: object

In [106]:
df["Colour"].isnull().sum()

np.int64(50)

In [107]:
df["Colour"].value_counts()

Colour
White    390
Blue     302
Black     95
Red       88
Green     75
Name: count, dtype: int64

In [108]:
df["Colour"].unique()

array(['Black', 'White', 'Blue', 'Red', 'Green', nan], dtype=object)

In [109]:
df["Colour"].mode()

0    White
Name: Colour, dtype: object

In [112]:
df["Colour"]=df["Colour"].fillna(df["Colour"].mode())

In [115]:
df["Colour"].unique()

array(['Black', 'White', 'Blue', 'Red', 'Green'], dtype=object)

In [114]:
df.replace({"Colour":{np.nan:df["Colour"].mode()}},inplace=True)

In [116]:
df.isnull().sum()

Make              0
Colour            0
Odometer (KM)    50
Doors            50
Price             0
dtype: int64

In [118]:
df["Odometer (KM)"].isnull().sum()

np.int64(50)

In [119]:
df["Odometer (KM)"]

dtype('float64')

In [120]:
df["Odometer (KM)"]=df["Odometer (KM)"].fillna(df["Odometer (KM)"].mean())

In [121]:
df["Odometer (KM)"].isnull().sum()

np.int64(0)

In [122]:
df.isnull().sum()

Make              0
Colour            0
Odometer (KM)     0
Doors            50
Price             0
dtype: int64

In [123]:
df["Doors"].isnull().sum()

np.int64(50)

In [130]:
df["Doors"].unique()

array([4., 3., 5.])

In [125]:
df["Doors"].value_counts()

Doors
4.0    811
5.0     75
3.0     64
Name: count, dtype: int64

In [128]:
df.replace({"Doors":{np.nan:4.0}},inplace=True)

In [129]:
df["Doors"].isnull().sum()

np.int64(0)

In [131]:
df.isnull().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64